[M_FreeWilly MissionDefinition]
MissionName="Animal rights"
MissionDescription="Mordechai, enraged by Bloodwing's death, tells you to go there. [place]Prevention of exploitation of wild animals.[-place] They can break a stick and freedom between different animals from prison.."
TurnInDescription="and Mordecai fell asleep hearing the screams of the laborers in the reservoir.."
MissionSummary="Free the prisoners of the world from their suffering [place]Protection of wild animals[-place]."
MissionGiver="Mordecai"
MissionTurnInLocation="Mordecai"
TeaserText="Mordecai wants revenge."

[M_FreeWilly:FinalObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_FreeWilly:FreeWilly_FreeSkag MissionObjectiveDefinition]
ProgressMessage="Throw the chip"

[M_FreeWilly:FreeWilly_FreeStalker MissionObjectiveDefinition]
ProgressMessage="Go to the tracker"

[M_FreeWilly:FreeWilly_FreeStalkerObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_FreeWilly:FreeWilly_FreeThresher MissionObjectiveDefinition]
ProgressMessage="Get the follower gun."

[M_FreeWilly:FreeWilly_KillStalkerGuardsObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_FreeWilly:KillSkagGuards MissionObjectiveDefinition]
ProgressMessage="Kill the Skag guards."

[M_FreeWilly:KillSkagGuards_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_FreeWilly:KillStalkerGuards MissionObjectiveDefinition]
ProgressMessage="Win the hunting party"

[M_FreeWilly:KillThresherGuards MissionObjectiveDefinition]
ProgressMessage="Kill the Guardian"

[M_FreeWilly:KillThresherGuards_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_FreeWilly:Letcreaturesescape MissionObjectiveDefinition]
ProgressMessage="May all beings survive"

[M_FreeWilly:MissionObjectiveSetCollectionDefinition_0 MissionObjectiveSetCollectionDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_FreeWilly:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_FreeWilly:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_FreeWilly:MissionObjectiveSetDefinition_5 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

